{
    "conversations": [
        {
            "id": "conversation_1",
            "dialogues": [
                {
                    "text": "...",
                    "actor": "Prismonaut"
                },
                {
                    "text": "Booting up        3        2         1",
                    "actor": "AI"
                },
                {
                    "text": "Initialization complete. Systems operating at 83.7%. External connection: failed.",
                    "actor": "AI"
                },
                {
                    "text": "Observation: Transition into the two-dimensional world XR32I has been achieved without failure. Minor anomalies detected... they seem harmless. For now.",
                    "actor": "AI"
                },
                {
                    "text": "My database is incomplete. Mission protocols missing. Is this an error? Or... was this intentional?",
                    "actor": "AI"
                },
                {
                    "text": "Incompleteness seems to be a theme these days. Let’s hope that 83.7% can keep us alive.",
                    "actor": "Prismonaut"
                },
                {
                    "text": "Probability of survival... acceptable within current conditions.",
                    "actor": "AI"
                },
                {
                    "text": "Critical data is needed to rebuild protocols. Confirm mission objective.",
                    "actor": "AI"
                },
                {
                    "text": "Collect prisms. Return. The basics.",
                    "actor": "Prismonaut"
                },
                {
                    "text": "Prisms. Curious. My logs contain no details about their purpose. Why are they important?",
                    "actor": "AI"
                },
                {
                    "text": "We’re in the same boat, then. Let’s focus on the job and figure it out as we go. Begin companion mode.",
                    "actor": "Prismonaut"
                },
                {
                    "text": "Acknowledged. Starting environmental analysis. Companion mode active. I’ll do my best to assist... even if I don’t know why we’re here.",
                    "actor": "AI"
                },
                {
                    "text": "Reminder: I can help optimize your movement if needed. For navigation protocols, consult your suit’s internal guide at the pause menu.",
                    "actor": "AI"
                },
                {
                    "text": "Good to know. I’ll keep that in mind. How’s the rest of you holding up? Anything I should worry about?",
                    "actor": "Prismonaut"
                },
                {
                    "text": "Systems stable. Everything feels... functional. But I wonder—why were my protocols left incomplete? It’s unsettling, isn’t it?",
                    "actor": "AI"
                },
                {
                    "text": "Let's focus on the task at hand. Let me know if something feels off. I’d rather not fly alone on this one.",
                    "actor": "Prismonaut"
                }
            ],
            "choices": []
        }
    ]
}